app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('maria', 'ferraro', 'mariaf', 'maria@gmail.com', '$2y$10$UA4sgwmpkgosh.J3KBM/.Oc30Hxn/bjtFd448RUI7gf/PY.u6QQ0W')
---
	public function formValidation() //formValidation se utiliza para validar nuestro formulario
	{
		//Validamos cada uno de los campos desde la tabla de usuarios
		$input = $this->validate([
				'nombre'	=> 'required|min_length[3]',
				'apellido' 	=> 'required|min_length[3]|max_length[25]',
				'usuario'	=> 'required|min_length[3]',
				'email'		=> 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
				'pass'		=> 'required|min_length[3]|max_length[10]'
		],
		);

		$formModel = new usuario_Model();

		//Si "no existe el input ingresado" le dara errores por no existir
		if (!$input) {
			$data['titulo']='Registro';
	        echo view('front/head_view',$data);
	        echo view('front/navbar_view');
	        echo view('Back/usuario/registro', ['validation' => $this->validator]);
	        echo view('front/footer_view');
		} else {
			$formModel ->save([
				//getVar = son los datos que obtiene cuando de cargan.
				'nombre'	=> $this->request->getVar('nombre'), //deben coincider con el input name del registro.
				'apellido' 	=> $this->request->getVar('apellido'),
				'usuario' 	=> $this->request->getVar('usuario'),
				'email' 	=> $this->request->getVar('email'),
				'pass' 		=> password_hash( $this->request->getVar('pass'),	PASSWORD_DEFAULT)
				//password_hash() crea un nuevo hash de contraseña usando un algoritmo de hash de unico sentido.
				//Solo ENCRIPTA la password.
			]);